import { PrismaClient } from '@prisma/client';

const prisma = new PrismaClient();
async function main() {
  await prisma.packages.createMany({
    data: [
      {
        name: 'golden',
        price: '10',
        expirationTime: '30Days',
      },
    ],
  });
  await prisma.clients.createMany({
    data: [
      {
        packagesId: 1,
        company_name: 'ALIBABA',
        province: 'Mazandran',
        city: 'Sari',
        cto_name: 'Ali',
        cto_nationCode: '2081356007',
        cto_phone: '402934023',
        email: 'manirmp@gmail.com',
        username: 'manirmp',
        password: '*******',
        groupCodes: '2312312',
        company_logo: '',
        Address: '',
        Phones: '',
        website: '',
        cto_birthday: '',
        cto_fatherName: '',
        groupName: '',
        description: '',
      },
      {
        packagesId: 1,
        company_name: 'Snap',
        province: 'tehran',
        city: 'andimeshk',
        cto_name: 'test',
        cto_nationCode: '84534',
        cto_phone: '84488324',
        email: 'testclient@gmail.com',
        username: 'testclient',
        password: '*******',
        groupCodes: '2312313',
        company_logo: '',
        Address: '',
        Phones: '',
        website: '',
        cto_birthday: '',
        cto_fatherName: '',
        groupName: '',
        description: '',
      },
    ],
  });
  await prisma.news.createMany({
    data: [
      {
        id: 1,
        title: 'شرایط سفر به گرجستان سخت تر شد!',
        createdAt: '2023/02/09',
        description: `
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک`,
      },
      {
        id: 2,
        title: 'شرایط سفر به گرجستان سخت تر شد!',
        createdAt: '2023/02/09',
        description: `
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک`,
      },
      {
        id: 3,
        title: 'شرایط سفر به گرجستان سخت تر شد!',
        createdAt: '2023/02/09',
        description: `
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک`,
      },
      {
        id: 4,
        title: 'شرایط سفر به گرجستان سخت تر شد!',
        createdAt: '2023/02/09',
        description: `
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک
        خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک   خبر شماره یک`,
      },
    ],
  });

  await prisma.program.createMany({
    data: [
      {
        status: 'ACTIVE',
        name: 'جواهرده رامسر',
        groupsCode: '2312312',
        time: '6 صبح',
        departure: 'میدان آزادی',
        price: '9500000',
        description:
          'این برنامه به صورت آفرود در جاده زیبای جواهرده رامسر به صورت فول برد برگزار می شود',
        type: 'آفرود',
        capacity: '30 نفر',
        access: 'اتوبوس توریستی و ماشین آفرود',
        cautions: [
          'بدون اطلاع لیدر از گروه جدا نشوید',
          'وظایف و مسئولیت های خود را حتما انجام دهید',
          'پول نقد کمتر همراه داشته باشید',
          'به حیوانات مطلقا نزدیک نشوید',
        ],
        maxBonuses: '10',
        stars: '1',
        date: '1402/04/01',
        images: ['javaher1.webp', 'javaher2.jpg', 'javaher3.webp'],
        days: '2',
        leader: 'پیام محمدی',
        services: ['ترنسفر،بیمه،لیدر کارت دار حرفه ای،چای آتیشی'],
        placeOptions: ['وای فای رایگان'],
        things: ['کوله پشتی', 'کفش کوهنوری', 'فلاسک', 'کیسه خواب', 'ظروف شخصی'],
      },
      {
        status: 'ACTIVE',
        name: 'چشمه بل',
        groupsCode: '2312313',
        time: '10 صبح',
        departure: 'میدان آزادی',
        price: '2700000',
        description: 'این برنامه به صورت آفرود در چشمه زیبای بل برگزار می شود',
        type: 'آفرود',
        capacity: '30 نفر',
        access: 'اتوبوس توریستی و ماشین آفرود',
        cautions: [
          'بدون اطلاع لیدر از گروه جدا نشوید',
          'وظایف و مسئولیت های خود را حتما انجام دهید',
          'پول نقد کمتر همراه داشته باشید',
          'به حیوانات مطلقا نزدیک نشوید',
        ],
        maxBonuses: '20',
        stars: '1',
        date: '1402/11/30',
        images: ['cheshme1.webp', 'cheshme2.jpeg', 'cheshme3.jpg'],
        days: '2',
        leader: 'پیام محمدی',
        services: ['ترنسفر،بیمه،لیدر کارت دار حرفه ای،چای آتیشی'],
        placeOptions: ['وای فای رایگان'],
        things: ['کوله پشتی', 'کفش کوهنوری', 'فلاسک', 'کیسه خواب', 'ظروف شخصی'],
      },
      {
        status: 'ACTIVE',
        name: 'خالد نبی',
        groupsCode: '2312312',
        time: '6 صبح',
        departure: 'میدان آزادی',
        price: '9500000',
        description:
          'این برنامه به صورت آفرود در محله زیبای خالد نبی برگزار می شود',
        type: 'آفرود',
        capacity: '45 نفر',
        access: 'اتوبوس توریستی و ماشین آفرود',
        cautions: [
          'بدون اطلاع لیدر از گروه جدا نشوید',
          'وظایف و مسئولیت های خود را حتما انجام دهید',
          'پول نقد کمتر همراه داشته باشید',
          'به حیوانات مطلقا نزدیک نشوید',
        ],
        maxBonuses: '30',
        stars: '3',
        date: '1402/11/20',
        images: ['khaled1.jpg', 'khaled2.jpg'],
        days: '5',
        leader: 'امیر محمدی',
        services: ['ترنسفر،بیمه،لیدر کارت دار حرفه ای،چای آتیشی'],
        placeOptions: ['وای فای رایگان'],
        things: ['کوله پشتی', 'کفش کوهنوری', 'فلاسک', 'کیسه خواب', 'ظروف شخصی'],
      },
      {
        status: 'ACTIVE',
        name: 'جنگل فندقلو',
        groupsCode: '2312313',
        time: '8 صبح',
        departure: 'میدان آزادی',
        price: '11000000',
        description: 'این برنامه به صورت آفرود در جنگل زیبای برگزار می شود',
        type: 'آفرود',
        capacity: '20 نفر',
        access: 'اتوبوس توریستی و ماشین آفرود',
        cautions: [
          'بدون اطلاع لیدر از گروه جدا نشوید',
          'وظایف و مسئولیت های خود را حتما انجام دهید',
          'پول نقد کمتر همراه داشته باشید',
          'به حیوانات مطلقا نزدیک نشوید',
        ],
        maxBonuses: '20',
        stars: '1',
        date: '1402/11/01',
        images: ['fandoghloo1.webp', 'fandoghloo2.webp', 'fandoghloo3.webp'],
        days: '7',
        leader: 'پیام امیری',
        services: ['ترنسفر،بیمه،لیدر کارت دار حرفه ای،چای آتیشی'],
        placeOptions: ['وای فای رایگان'],
        things: ['کوله پشتی', 'کفش کوهنوری', 'فلاسک', 'کیسه خواب', 'ظروف شخصی'],
      },
    ],
  });
}

// execute the main function
main()
  .catch((e) => {
    console.error(e);
    process.exit(1);
  })
  .finally(async () => {
    // close Prisma Client at the end
    await prisma.$disconnect();
  });
